<?php

return [
    'token' => [
        'invalid' => 'توکن نامعتبر است',
        'expired' => 'توکن منقضی شده است',
        'consumed' => 'توکن مصرف شده است',
    ],
    'auth' => 'برای ورود / ثبت نام شماره موبایل یا آدرس ایمیل را وارد کنید',
    'users' => [
        'inactive' => 'حساب کاربری شما غیرفعال شده است',
    ],
    'login' => [
        'disabled' => 'امکان ورود غیرفعال است',
        'pass' => 'لطفا رمزعبور را وارد کنید',
        'no_otp_use_pass' => 'برای حساب کاربری شما هیچ سرویس رمز یکبار مصرفی وجود ندارد. لطفا با رمزعبور وارد شوید',
        'pass_error' => 'رمزعبور نامعتبر است',
        'user_no_otp' => 'برای حساب کاربری شما هیچ سرویس رمز یکبار مصرفی وجود ندارد',
        'one_otp_error_use_pass' => 'لطفا رمزعبور را وارد کنید',
    ],
    'register' => [
        'disabled' => 'امکان ثبت نام غیرفعال است',
        'with_email' => 'لطفا با ایمیل ثبت نام کنید',
        'with_phone' => 'لطفا با شماره موبایل ثبت نام کنید',
        'passes' => 'لطفا رمزعبور و تایید آن را وارد کنید',
        'pass_conf' => 'رمزعبور با تایید آن مطابقت ندارد',
        'no_otp_email_use_phone' => 'سرویس رمز یکبار مصرف ایمیل غیرفعال است. لطفا با شماره موبایل ثبت نام کنید',
        'no_otp_email_phone' => 'سرویس رمز یکبار مصرف ایمیل غیرفعال است. همچنین امکان ثبت نام با شماره موبایل نیز وجود ندارد',
        'no_otp_phone_use_email' => 'سرویس رمز یکبار مصرف برای موبایل غیرفعال است. لطفا با ایمیل ثبت نام کنید',
        'no_otp_phone_email' => 'سرویس رمز یکبار مصرف برای موبایل غیرفعال است. همچنین امکان ثبت نام با ایمیل نیز وجود ندارد',
    ],
    'email_phone' => [
        'invalid' => [
            'email' => 'آدرس ایمیل نامعتبر است',
            'phone' => 'شماره موبایل نامعتبر است',
        ],
    ],
    'otp' => [
        'options' => 'لطفا یکی از سرویس های رمز یکبار مصرف را انتخاب کنید',
        'error' => [
            'invalid_type' => 'سرویس رمز یکبار مصرف نامعتبر است',
            'invalid_code' => 'رمز یکبار مصرف اشتباه است',
            'email' => 'امکان ارسال رمز یکبار مصرف به آدرس ایمیل :identifier وجود ندارد',
            'call' => 'امکان تماس با :identifier وجود ندارد',
            'sms' => 'امکان ارسال رمز یکبار مصرف از طریق پیامک به :identifier وجود ندارد',
            'ussd' => 'استفاده از سرویس ussd وجود ندارد',
            'otp_generator' => 'امکان استفاده از سرویس رمزساز وجود ندارد',
            'telegram' => 'امکان ارسال رمز یکبار مصرف به :identifier در تلگرام وجود ندارد',
            'whatsapp' => 'امکان ارسال رمز یکبار مصرف به :identifier در واتساپ وجود ندارد',
        ],
        'send' => [
            'email' => 'رمز یکبار مصرف به آدرس :identifier ارسال شد',
            'call' => 'رمز یکبار مصرف از طریق تماس با شماره :identifier به شما اعلام خواهد شد',
            'sms' => 'رمز یکبار مصرف به شماره :identifier پیامک شد',
            'ussd' => 'برای دریافت رمز یکبار مصرف کد :ussd را با شماره موبایل :identifier شماره گیری کنید',
            'otp_generator' => 'رمز یکبار مصرف تولید شده توسط رمزساز را وارد کنید',
            'telegram' => 'رمز یکبار مصرف به شماره :identifier در تلگرام ارسال شد',
            'whatsapp' => 'رمز یکبار مصرف به شماره :identifier در واتساپ ارسال شد',
        ],
        'sent' => [
            'email' => 'رمز یکبار مصرف به آدرس :identifier ارسال شده است',
            'call' => 'رمز یکبار مصرف از طریق تماس با شماره :identifier به شما اعلام خواهد شد',
            'sms' => 'رمز یکبار مصرف به شماره :identifier پیامک شده است',
            'ussd' => 'برای دریافت رمز یکبار مصرف کد :ussd را با شماره موبایل :identifier شماره گیری کنید',
            'otp_generator' => 'رمز یکبار مصرف تولید شده توسط رمزساز را وارد کنید',
            'telegram' => 'رمز یکبار مصرف به شماره :identifier در تلگرام ارسال شده است',
            'whatsapp' => 'رمز یکبار مصرف به شماره :identifier در واتساپ ارسال شده است',
        ],
    ],
];
